[{"title": "The Seven Deadly Sins", "year": 2018, "nyear": "18", "image": "/legacy/images/articles/tsds.webp", "credits": "byTimothy on Unsplash", "category": "Poetry", "cols": 2, "content": "<p class=\"no-indent writing-col-2\">Bolting in, like a swarm of fire<br>Which brought life to its knees<br>Agony, a torment of desire<br>A trauma, a fraud of deeds<br><br>It’s the time of reckoning, as death’s fire shone<br>Admiring hell, a red blazing nightgown<br>For soon your soul; it would own<br><br>Awe, an emotion that would capture your heart<br>Overwhelming until it reaches every nerve cell of your pitiful torso<br>Just think of every moment of virtue you thwart<br>How you decided that your yearning is not to forgo<br><br>Death is jovial<br>You said once when your heart was palpitating<br>as it would in the prime of one’s life<br><br>Matters not<br>Whatsoever kind of bravery you had at one moment<br>It shall not be of much aid,<br>as your inevitable suffering shall start<br>and ruin you with a deadly rife<br><br>A pain you got,<br>Would force you to appeal for one more chance<br>Is it possible? It is not<br>But I may hear the fragile remains of what you used to call your voice pleading not guilty,<br>Shall you let me list the aspects of your cruelty?<br><br>As with pride, came your soul with a boast<br>Excessive hatred aligned with gloat<br>I always quired, would a little deprecate come at a cost?<br>Selfishness was your bliss which for you sought<br><br>Your rotten bones brought you envy<br>Jealousy, propagating through your broken-down soul<br>Crawling the wreckage of you like vine or ivy<br>Abhorrence and loath you shared with all<br><br>Vengeful, a trait of yours<br>Came your fury, came your wrath<br>Avenging, broke you down more and more<br>Spreading your anger, along the path<br><br>Forlorn, pathetic; you chose sloth<br>That made you weaker as days passed on<br>What you thought of as happiness was your only loss<br>Your time ran out, and you were all gone<br><br>A blindfold that covered your heart<br>Was of your vicious greed<br>A tyrant’s desire as for wealth to never part<br>That deeply shattered you indeed<br><br>As dine with no N can be DIE<br>So did your grasping desires<br>Your gluttony rose up high<br>Only to rage more fires<br><br>In a labyrinth of your mind, you became lost<br>As you can never find your way back<br>Your own sight has been clouded by lust<br>Which knocked you down into wrack<br><br>\"Are you ready\", I uttered in a hellish tone<br>To meet the devil with the red eye, to shatter, to moan<br>\"I'm ready\", at last, leaving his selfishness and pleas<br>Giving away to his destiny, following with no “please” … AGONY<br><br>Agony, a torment of desire<br>A trauma... A fraud of deeds!</p>", "side": "<p class=\"no-indent\">* picture by Timothy on Unsplash</p><p class=\"no-indent\">This piece was written in the favor of the author's best friend upon his death. It is meant to convey the author's hatred for death, portraying it as a monster, and exhibiting the afterlife as just and unbiased. The Seven Deadly Sins was the first piece ever written by the author and opened a window for self-reflection.</p><p class=\"no-indent\"></p><p class=\"no-indent\">This piece has been recognized by The U.S. Embassy and Consulate in Cairo and The International Writing Program.</p>", "desc": "This piece was written in the favor of the author's best friend upon his death. It is meant to convey the author's hatred for death, portraying it as a monster, and exhibiting the afterlife as just and unbiased. The Seven Deadly Sins was the first piece ever written by the author and opened a window for self-reflection.", "brief": "This piece was written in the favor of the author's best friend upon his death. It is meant to convey the author's hatred for death, portraying it as a monster, and exhibiting the afterlife as just and unbiased. The Seven Deadly Sins was the first piece ever written by the author and opened a window for self-reflection.", "order": 1, "include": null}, {"title": "Clichés", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/cliches.webp", "credits": "byMatt Briney on Unsplash", "category": "Poetry", "cols": 3, "content": "<p class=\"no-indent writing-col-3\">Clichés<br>laid in twos<br>glistening<br>with the sun’s pristine<br>melting their Koueider treats<br>their eyes<br>drown an Olympic swimmer—<br>deep blue of the river in its swiftly pace<br>deep blue of the melancholy in eyes of the heartbroken<br>they come back<br>and<br>forth<br>and<br>up… into The Platform Yacht<br>clichés<br>sundered in the presence of the Daffodils<br>mourning the blue<br>into the black<br>but they are still clichés\r<br><br>Clichés<br>in Family Land<br>or El Bandar<br>waiting<br>eagerly<br>until it hits 6<br>hands held<br>a cliché<br>over<br>the red chairs<br>mourning the sun<br>into the big screen’s light<br>then at 8:<br>one<br>strike<br>one<br>missed<br>down<br>the bowling alley<br>or<br>one hit<br>one lost<br>in 8 pool<br>or silly laughters<br>when you<br>slip<br>in Ice Planet<br>but they are still clichés<br><br>Clichés<br>strolling in Converse<br>over No. 9<br>a Crispy Mix<br>from City Crepé<br>or corn dog<br>at The Backyard<br>Shawrma<br>by the corner side<br>of Abu Mazen<br>maybe<br>you leave<br>unto Al Nasr Street<br>where you find it silly—<br>the size of a Quarter Pounder<br>through the Drive-thru<br>over<br>the Mexican Fil<br>that you<br>devour<br>in Chicken Fil-A<br>or a Big Zack<br>from the Courtyard<br>you<br>sure<br>shouldn’t<br>have had<br>those<br>extra<br>calories<br>but you don’t care<br>because they’re still clichés<br>Clichés<br>lost<br>in alleys<br>that could only<br>look<br>the same<br>after you returned<br>from Tuesday’s training<br>at your favorite<br>Wadi Degla Club<br>or when you’re running late<br>from a failing shopping attempt<br>at Grand Mall<br>but still you got<br>that Schogetten and Lindl you love<br>dark<br>and white<br>from their candy store <br>and that was enough<br>to make<br>it worth it<br>but they’re still clichés<br>Clichés<br>as if you’re kids<br>chasing each other<br>down No. 7’s solitude<br>sneaking<br>a song<br>by Amr Diab<br>on the single headphone pair<br>you share together<br>sneaking<br>a touch<br>sneaking<br>a hug<br>sneaking<br>a kiss<br>sneaking<br>and sneaking<br>—and <br>sneaking<br>before 11<br>when the Metro <br>ends its shift<br>for the day<br>and you have to leave<br>that’s when you know<br>that it is<br>not<br>a cliché</p>", "side": "<p class=\"no-indent\">* picture by Matt Briney on Unsplash</p><p class=\"no-indent\">Amidst the fourth month of emotionally-challenging quarantine, this piece represents the author’s longing for his city, Maadi. The poem portrays Maadi as \"the city of love,\" exploring different parts of it from the prespective of a couple. This is a free verse poem; however, it heavily employs parallelism, repititon, and alternation.</p><p class=\"no-indent\"></p><p class=\"no-indent\">This piece has been published in Between the Lines: Peace and Writing Experience 2020 Anthology.</p>", "desc": "Amidst the fourth month of emotionally-challenging quarantine, this piece represents the author’s longing for his city, Maadi. The poem portrays Maadi as \"the city of love,\" exploring different parts of it from the prespective of a couple. This is a free verse poem; however, it heavily employs parallelism, repititon, and alternation.", "brief": "The feeling of longing overwhelms the author as he fragmented memories become reminiscent of his close past. The poem shifts between memories the would-have-been future, while following the iambic pentameter.", "order": 2, "include": null}, {"title": "For Life is Not Life Without You", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/forlife.webp", "credits": "byNagesh Badu on Unsplash", "category": "Poetry", "cols": 2, "content": "<p class=\"no-indent writing-col-2\">Why do I still fall like it’s our first day,\r<br>when I know your heart does not fall for me?\r<br>Why do you live an image in my mind,\r<br>chasing me down and not letting me free\r<br>\r<br>Why do I still bear fear of losing you,\r<br>fearing a damage that have long been done?\r<br>Why can’t I forget every strand of your\r<br>hair—radiating their warmth into our love?\r<br>\r<br>Why can’t I forget how your mellow voice,\r<br>calling your bunny from across the phone?\r<br>Or forget the time you held me captured\r<br>for it you knew I feared to stay alone\r<br>\r<br>Why can't your love depart my aching heart,\r<br>an: let me heal those pieces of regret?\r<br>Why can’t I move on from the memory\r<br>of the presence of you the day we met?\r<br>\r<br>Why can’t I have you the way my heart wants,\r<br>feeling your hair under a starry sky?\r<br>When will I let this memory part my\r<br>ruptured feelings—for I can’t let you die\r<br>\r<br>For I can’t bury your memory un—\r<br>—der the heap of my unheartily thoughts\r<br>And for I can’t let your spirit just go\r<br>to suffer the hostile feelings I fought\r<br>\r<br>For I wish to the stars on every day\r<br>and listen—to what the sky tenants say\r<br>For they might tell me once you’re coming back\r<br>but their whispers never said you would stay\r<br>\r<br>For my heart aches to hear “my bunny”\r<br>out of your melodious unshifted lips\r<br>For my heart aches for the softness that\r<br>you hide from each one, yet for me it slips\r<br>\r<br>Can you hear my heart pounding, my pumpkin?\r<br>Do you still feel it when I long for you?\r<br>Can you hear my soft whispers in your sleep?\r<br>Do you still believe how you make me glow?\r<br>\r<br>Surreal—is me holding your hands shyly \r<br>tangling our intertwined fingers with love\r<br>Or closing our torsos in one tight hug\r<br>that levitates our souls to above\r<br>\r<br>Surreal—to have you snuggled in my embrace\r<br>holding my arms in the home of us two\r<br>when I know that your heart belongs to me\r<br>And this my loving heart belongs to you\r<br>\r<br>Surreal—is losing time when you’re around\r<br>when my heart fights to leave its locking doom\r<br>when I want to hug you in tight and cry\r<br>and in some warm breath whisper “I love you.”</p>", "side": "<p class=\"no-indent\">* picture by Nagesh Badu on Unsplash</p><p class=\"no-indent\">The feeling of longing overwhelms the author as he fragmented memories become reminiscent of his close past. Eventually, the poem shifts from portraying memories into a fantasy image of the would-have-been future in the author's mind. Ultimately, the poem follows the iambic pentameter and employs heavy use of imagery and repitition.</p>", "desc": "The feeling of longing overwhelms the author as he fragmented memories become reminiscent of his close past. Eventually, the poem shifts from portraying memories into a fantasy image of the would-have-been future in the author's mind. Ultimately, the poem follows the iambic pentameter and employs heavy use of imagery and repitition.", "brief": "The feeling of longing overwhelms the author as he fragmented memories become reminiscent of his close past. The poem shifts between memories the would-have-been future, while following the iambic pentameter.", "order": 3, "include": null}, {"title": "Who Is Free on the Land of the Free?", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/whoisfree.webp", "credits": "byGabe Pierce on Unsplash", "category": "Poetry", "cols": 2, "content": "<p class=\"no-indent writing-col-2\">\n    <i>\n    This is the land of the free,<br>and here I stand<br>Together we make the plea<br>to stay hand-in-hand<br>Together we bring<br>the unfeasible true<br>When the whole world cries “crazy,”<br>we do it through<br>And we’ve done it before<br>We’ve reached\n    out to the stars<br>and we’ve bargained on more<br>For the future, for us, for our kids, for our families<br>Yes, I’m the man of the land of the free\n</i>\n    <br>\n    <br>\n    <b>\n    Now let me ask, who is free on the land of the free<br>Or wasn’t Floyd one of those free?<br>A cold-blooded COP pressing his monstrous knee<br>Until the Floyd man gave up breath<br>Are you telling me George deserved his death?<br><br>You take pride\n    in the flag, and might in the constitution<br>How dare you grant your nights absolution?<br>Absolution from the burden of what you vividly see,<br>yet your expired heart lets it be<br><br>Again…<br>Like you did in Montgomery back then<br>Or did you\n    think the past would just fade away,<br>like your ancestors thought waging hate on this bay?\n</b>\n    <br>\n    <br>\n    <i>    Don’t you think we’re on the same page?<br>Or can’t you even contain your rage?<br>“All Lives Matter,” or should it be just black?<br>What if it was my kid who was under attack?<br>You can’t see the whole picture through;<br>you only see what matters\n    to you.</i>\n    <br>\n    <br>\n    <b>\n    What if it was your kid who was under a threat?<br>How easily does your blank mind forget?<br>\n    <br>How easy is it to forget Rice’s son?<br>A 12-year-old shot for holding a toy gun<br>Or forget Brown whose death left a scar who died on suspicion of owning Cigar<br>And how do you forget the Scott man<br>whose only crime was that he ran<br><br>“All\n    Lives Matter,” indeed\n    <br>but don’t let your sight be blinded with greed</b>\n    <br>\n    <br>\n    <i>    Your head is full on its own; you can’t even see<br>that you’re the one blinded to a terrifying degree<br>Is not it safety our common end,<br>to live without fear or hating intents?<br>But now you want to defund the police<br>To free the way to your\n    peers to murder our peace<br>Do you want our streets free of crime,<br>or do you just want to continue your whine?<br>Would havoc satisfy your regress?<br>That’s all you ever want: more mess\n</i><br>\n    <br>\n    <b>\n    Do you think these murderer COPs ever faced a charge?<br> Still armed—they roam the states out at large<br> Motivated by their bias of discrimination<br> Those are ones ruining our prideful nation\n    <br> You always think low of us and our kind<br> that we don’t even deserve to be kept in mind?<br> What do you know about us?<br> Except for all that made up fuss<br><br> That we’re cruel, savage, and criminals<br> Uneducated ruthless animals<br>    Less than humans and should die<br> Our only crime is our skin dye<br><br> You get to live unwary of our daily fight<br> While we fear day and night<br> Fear of my kid bullied at class,<br> or being regularly harassed<br> or being called names<br>    or being accused of false claims<br><br> You say we are different,<br> but what did we ever do?<br> Yes, we’re the minority,<br> but the majority is who?<br> Does being a minority take away our rights?<br> Those our fathers wrote amid their nights?<br>    <br> You may not see the picture yet through<br> But I’m black, and I want a life too…<br>\n</b>\n</p>", "side": "<p class=\"no-indent\">* picture by Gabe Pierce on Unsplash</p><p class=\"no-indent\">The author uses writing as a platform to speak up during the events of Black Lives Matter through a fictional conversation that occurs between an opposer of BLM and a black man. This piece aims to silence many of the arguments used by BLM opposers. The poem employs African American rap-style rhymes for cultural authenticity and exemplifies many historical scenes.</p>", "desc": "The author uses writing as a platform to speak up during the events of Black Lives Matter through a fictional conversation that occurs between an opposer of BLM and a black man. This piece aims to silence many of the arguments used by BLM opposers. The poem employs African American rap-style rhymes for cultural authenticity and exemplifies many historical scenes.", "brief": "The author uses writing as a platform to speak up during the events of Black Lives Matter through a fictional conversation that occurs between an opposer of BLM and a black man. This piece aims to silence many of the arguments used by BLM opposers.", "order": 4, "include": null}, {"title": "The Cosmic Dance", "year": 2021, "nyear": "21", "image": "/legacy/images/articles/jupiter.webp", "credits": "byLiviu Florescu on Unsplash", "category": "Poetry", "cols": 0, "content": "<p class=\"no-indent writing-col-0\">I am watching Jupiter,\r<br>strolling among our skies like a lost child,\r<br>greeting Saturn like the long-orphaned by luck who just met his father,\r<br>But I can’t see Jupiter, nor can I see Saturn today.\r<br>I can’t see the curves of their fabulous smiles;\r<br>I can’t take in the rosy cheeks that skies present;\r<br>I can’t absorb the warmness as those stars step in closer.\r<br>I never fathomed the stars,\r<br>Nor did the heavens fascinate me.\r<br>I failed to believe in the might of a shooting star,\r<br>firing my wish for this moment to persist.\r<br>I failed to contemplate love for the full moon,\r<br>Or any other astronomical sighting you loved.\r<br>Yet, here I was, watching Jupiter and Saturn;\r<br>I was watching their little tip-toe dances with you,\r<br>and I was dreaming of our little tip-toe dance to the sound of the high heavens colliding as our beat.\r<br>You learned the steps to their tip-toe scene, while\r<br>I memorized every step in your smile as you anticipated the next move in their show.\r<br>You believed in the stars, and so I tried to believe too...\r<br>And so I did,\r<br>   But you were my only star.\r<br>I don’t remember that\r<br>   My eyes missed a step in its tip-toe dance with the curves of your happy cheeks that night.\r<br>I don’t remember\r<br>   If all heavens ever seemed to shine brighter than you that night.\r<br>I don’t remember \r<br>   I looked at the sky that night.\r<br>Because that night\r<br>   I was watching my Jupiter.</p>", "side": "<p class=\"no-indent\">* picture by Liviu Florescu on Unsplash</p><p class=\"no-indent\">The lost child meets his long-gone father in a fabuolous galactic scene: Jupiter and Saturn take turns dancing into the sky, eagerly overwatched by an Earthian seeker. Amid the scene, the author is distracted by the presence of the Earthian seeker. Another variation of this poem, also written during the same night, however, in iambic pentameter instead of free verse, can be seen in The Universal Division Equation of Man (prose).</p>", "desc": "The lost child meets his long-gone father in a fabuolous galactic scene: Jupiter and Saturn take turns dancing into the sky, eagerly overwatched by an Earthian seeker. Amid the scene, the author is distracted by the presence of the Earthian seeker. Another variation of this poem, also written during the same night, however, in iambic pentameter instead of free verse, can be seen in The Universal Division Equation of Man (prose).", "brief": "The lost child meets his long-gone father in a fabuolous galactic scene: Jupiter and Saturn take turns dancing into the sky, eagerly overwatched by an Earthian seeker. Amid the scene, the author is distracted by the presence of the Earthian seeker.", "order": 5, "include": null}, {"title": "Her Smile", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/smile.webp", "credits": "byHybrid on Unsplash", "category": "Poetry", "cols": 0, "content": "<p class=\"no-indent writing-col-0\">Light falls unto your brown eyes\r<br>Shining with the glimmer of the day\r<br>Why do I wonder long of that gleam?\r<br>Why do I petrify upon your sway?\r<br>\r<br>You captured the heart that once belonged to me\r<br>And my heart feels your touch warm and deep\r<br>The beauty of that sensation trails to the sky\r<br>Like a star through the universe making its leap\r<br>\r<br>I am lost in that smile brought unto your face\r<br>A labyrinth I can never leave\r<br>Or ought I find that smile to make me weak\r<br>My smile dwells in harmony, I believe\r<br>\r<br>I stare upon that curly hair of yours\r<br>It curls on my thoughts again and again\r<br>But what is it that makes you special?\r<br>What is it that makes me fall into your den?\r<br>\r<br>Why with you do I feel so frail?\r<br>Why is it that you hinder my control?\r<br>Make me more vulnerable, more exposed\r<br>Why do your words touch my soul?\r<br>\r<br>Like no other girl, I once tried to say\r<br>But did you believe that was real?\r<br>That I never felt that way before you\r<br>That your existence makes me heal\r<br>\r<br>You are like no other in the world\r<br>Do I really have to spell it out to you?\r<br>That you’re the one I seek the most\r<br>That girl... I love you\r<br></p>", "side": "<p class=\"no-indent\">* picture by Hybrid on Unsplash</p><p class=\"no-indent\">Brown curls contrasting bright fair skin intermingle with a cheerish soft chuckle: this piece is formed of rhymed quartets which displays the author's vivid love of the sighting. Near its end, the poem shifts from describing the subject most notable characteristics into an announcement of love.</p>", "desc": "Brown curls contrasting bright fair skin intermingle with a cheerish soft chuckle: this piece is formed of rhymed quartets which displays the author's vivid love of the sighting. Near its end, the poem shifts from describing the subject most notable characteristics into an announcement of love.", "brief": "Brown curls contrasting bright fair skin intermingle with a cheerish soft chuckle: this piece is formed of rhymed quartets which displays the author's vivid love of the sighting. Near its end, the poem shifts from describing the subject most notable characteristics into an announcement of love.", "order": 6, "include": null}, {"title": "Reflection", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/reflection.webp", "credits": "byCaroline Veronez on Unsplash", "category": "Poetry", "cols": 0, "content": "<p class=\"no-indent writing-col-0\">Her glimpse in the mirror petrified me—<br>in a stance of awe, it spoke to my soul<br>Lost in time—captured in the vain I be<br>With my heart aching, a heart you stole<br><br>Your eyes detained me in some eye-cuffs<br>Despair—seeking my history of err<br>and within heartly deeds concealed, it chuffs<br>to recite what time held us unaware<br><br>\"Enough,\" I beg your gently widening<br>-smile. Hopelessly trying to evade<br>your aura that never changed, ripening<br>in the distress of your so-called love shade<br><br>Our paths intertwined as stars made their charm<br>through the light thread of fantasy, we walked<br>Did I fall? I pondered in pride, alarmed<br>But your hand reached out to my fallen gawk<br><br>Time would heal, she says with her red lips sweet<br>as her hands trailed its way away from mine<br>her image dissipates and mine I greet<br>a reflection which I, to she, consign<br></p>", "side": "<p class=\"no-indent\">* picture by Caroline Veronez on Unsplash</p><p class=\"no-indent\">Originally written to represent a character's backstory, this poem exhibits mixed scenes of a past the author is trying to forget. The poem employs the use of multiple rhymes per line ranging from subtle to vivid, all embded in an iambic pentameter and supported with heavy imagery. The scene occurs in front of the mirror as the shadow of the antagonist crosses the mind of the subject.</p>", "desc": "Originally written to represent a character's backstory, this poem exhibits mixed scenes of a past the author is trying to forget. The poem employs the use of multiple rhymes per line ranging from subtle to vivid, all embded in an iambic pentameter and supported with heavy imagery. The scene occurs in front of the mirror as the shadow of the antagonist crosses the mind of the subject.", "brief": "Originally written to represent a character's backstory, this poem exhibits mixed scenes of a past the author is trying to forget. The poem employs the use of multiple rhymes per line ranging from subtle to vivid, all embded in an iambic pentameter and supported with heavy imagery.", "order": 7, "include": null}, {"title": "Is It Early?", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/early.webp", "credits": "byScott Broome on Unsplash", "category": "Poetry", "cols": 0, "content": "<p class=\"no-indent writing-col-0\">Is it too early to call my heart—\r<br>a prisoner of your life-saving ark,\r<br>flowing in the rivers of daises\r<br>and the devil alike?\r<br>\r<br>Is it too early to say that your hair—\r<br>handcuffs to my fragile veiny hands,\r<br>bolstered with a tensile of T-Cells\r<br>that stand still to your presence, my jailer?\r<br>\r<br>Is it too early to tell, in eye blinks\r<br>how light breaks through the stained glass\r<br>of the holy church of your love,\r<br>a reminder of my stubborn lure?\r<br>\r<br>Is it too early to let my breath?\r<br>asphyxiate on the aspiration\r<br>of your passionate moan taken over by \r<br>the contact my lips forcible make to yours?\r<br>\r<br>Is it too early to utter in non-melodious tunes\r<br>a song of broken lyrics of some Elvis\r<br>under the city's so called\r<br>holiday lights and mistletoes?\r<br>\r<br>Is it too early to announce with a grip\r<br>to your concave waist and your lonely eyes\r<br>as it hits mine it its short contact before we kiss\r<br>that you are mine... for real?</p>", "side": "<p class=\"no-indent\">* picture by Scott Broome on Unsplash</p><p class=\"no-indent\">The feeling of uncalled for love overwhelms the author as he gives in to an inexorable fate. The author symbolizes his love for multiple endeavors as the result of the same uncalled for love before eventually making peace with them.</p>", "desc": "The feeling of uncalled for love overwhelms the author as he gives in to an inexorable fate. The author symbolizes his love for multiple endeavors as the result of the same uncalled for love before eventually making peace with them. This is a free verse poem employs tense language.", "brief": "The feeling of uncalled for love overwhelms the author as he gives in to an inexorable fate. The author symbolizes his love for multiple endeavors as the result of the same uncalled for love before eventually making peace with them.", "order": 8, "include": null}, {"title": "Butterfly", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/butterfly.webp", "credits": "byAlfred Schrock on Unsplash", "category": "Poetry", "cols": 0, "content": "<p class=\"no-indent writing-col-0\">The summer breeze\r<br>Middle of July\r<br>A swift of air\r<br>From a butterfly\r<br>\r<br>The wings flap in harmony\r<br>While the heart skips a beat\r<br>Saying time is abstract\r<br>And present is obsolete\r<br>\r<br>But what does a butterfly have to do with fate?\r<br>Better: what does anything have to do with life?\r<br>Maybe we’re all connected\r<br>And maybe we’re all losing sight\r<br>\r<br>Like a puzzle of jigsaw\r<br>Each piece is dust in the void\r<br>As if it does not belong to the bigger picture\r<br>As if being seen was a sin to avoid \r<br>\r<br>Did I ever think I could see that picture?\r<br>That the world would let me do so\r<br>Or that I’m better than all others \r<br>To feel entitled to know\r<br>\r<br>To know what lies in the spooky nights of secrets\r<br>Or what lies in each of the mismatched hearts?\r<br>Maybe ignorance is a bless\r<br>Because knowing would break us into parts\r<br>\r<br>If ever,\r<br>Wouldn’t that butterfly know too?\r<br>Wouldn’t the summer breeze?</p>", "side": "<p class=\"no-indent\">* picture by Alfred Schrock on Unsplash</p><p class=\"no-indent\">The potency of the moment. Could you imagine your life, a result of someone else’s uneducated actions? Butterfly effect has always engrossed me with interest—for its own sake, I came to realize that my last year was but that very series of consecutive, dependent events. One action—one moment… shaped the people I meet, the friends I have, the places I go, and the effort I put. My mind flows into imagination of what I could’ve been if it wasn’t for that triggering event. Marvelous, isn’t it?</p>", "desc": "The potency of the moment. Could you imagine your life, a result of someone else’s uneducated actions? Butterfly effect has always engrossed me with interest—for its own sake, I came to realize that my last year was but that very series of consecutive, dependent events. One action—one moment… shaped the people I meet, the friends I have, the places I go, and the effort I put. My mind flows into imagination of what I could’ve been if it wasn’t for that triggering event. Marvelous, isn’t it?", "brief": "The potency of the moment. Could you imagine your life, a result of someone else’s uneducated actions? Butterfly effect has always engrossed me with interest—for its own sake, I came to realize that my last year was but that very series of consecutive, dependent events. One action—one moment… shaped the people I meet, the friends I have, the places I go, and the effort I put.", "order": 9, "include": null}, {"title": "Colors", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/colors.webp", "credits": "byDenise Shan on Unsplash", "category": "Poetry", "cols": 0, "content": "<p class=\"no-indent writing-col-0\">Someone tell the tree trunks that their brown shrivels to the brown of her hair curls.\r<br>Someone tell the sky that its azure rains away to that of her flowing words on a piece of paper.\r<br>Someone tell the ladybugs that they can get their colors from her hot-pink lips.\r<br>Someone tell the night that its black is more like grey when put next to her favorite black t-shirt.\r<br>Someone tell the rainbows that its colors feel black-and-white in her presence.\r<br>Someone tell my clumsy drawings from 4th grade which I promised to color that I found their colors.\r<br>Someone tell me to look no more for my missing aura because she painted my world in all hues.\r<br>Someone tell the birds, someone tell the bees, but most of all, someone tell her...\r<br>Someone tell her that she fills the colors in my life.\r<br></p>", "side": "<p class=\"no-indent\">* picture by Denise Shan on Unsplash</p><p class=\"no-indent\">The fascination of colors takes on a new meaning as she enters, obliterating every color but her own, like a portrait camera with a monochromatic filter. The way her colors vividly shine overwhelm her surrounding to shades of black and white. Colors is a short poem describing the meaning of colors around our loved endeavors and people. The poem uses repetition and light-hearted imagery to signify the heat of a lover.</p>", "desc": "The fascination of colors takes on a new meaning as she enters, obliterating every color but her own, like a portrait camera with a monochromatic filter. The way her colors vividly shine overwhelm her surrounding to shades of black and white. Colors is a short poem describing the meaning of colors around our loved endeavors and people. The poem uses repetition and light-hearted imagery to signify the heat of a lover.", "brief": "The fascination of colors takes on a new meaning as she enters, obliterating every color but her own, like a portrait camera with a monochromatic filter. The way her colors vividly shine overwhelm her surrounding to shades of black and white. Colors is a short poem describing the meaning of colors around our loved endeavors and people.", "order": 10, "include": null}, {"title": "La Lune", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/moon.webp", "credits": "byArron Visual on Unsplash", "category": "Poetry", "cols": 0, "content": "<p class=\"no-indent writing-col-0\">I landed in your arms like an astronaut returning from his Apollo mission\r<br>I felt like I was the first man on the moon in your embrace\r<br>I felt like you were the moon reflecting sunlight every time you smile\r<br>I felt the beauty of the full moon as if I stepped on it every time I touched your hands\r<br>I must be a lucky man\r<br>For not only I touched the moon,\r<br>but the moon extended its arms and touched me back\r<br>I’m a lucky man</p>", "side": "<p class=\"no-indent\">* picture by Arron Visual on Unsplash</p><p class=\"no-indent\">La Lune (English: The Moon) is a short free verse piece which uses a single imagery of the moon to describe a person of great importance to the author.</p>", "desc": "La Lune (English: The Moon) is a short free verse piece which uses a single imagery of the moon to describe a person of great importance to the author. ", "brief": "La Lune (English: The Moon) is a short free verse piece which uses a single imagery of the moon to describe a person of great importance to the author.", "order": 11, "include": null}, {"title": "Short Poems", "year": 2019, "nyear": "19", "image": "/legacy/images/articles/shortpoems.webp", "credits": "byFree Old Photos on Unsplash", "category": "Poetry", "cols": 0, "content": "<div class=\"writing\">\n    <div class=\"article\">\n        <h4>Storm</h4>\n\n        <p class=\"no-indent\">\n            <i class=\"caption\">\"Storm\" is a short piece that uses two main images taken from nature: a storm and a flower. Ultimately, the piece describes a significant toxic emotional encounter that leaves the subject emotionally distressed. However, as the subject attempts to forget the first instance, trying to mend the situation, the same encounter occurs once more. Finally, the subject builds up despise for the situation that led him to these encounters in the first place and announces himself as his foremost priority, looking out for himself.\n            </i><br /><br /> Silence kept the peace in me when I feared the storm<br /> A shelter to heal and hide from the truth<br /> It hurts<br /> The scar is now too deep<br /> The storm ravaged<br /> Damage is done<br /> Tranquil\n            <br /> You would think it is summer breeze before it's too late\n            <br /> It blew the land upside down<br /> Green is grey<br /> A flower blooms<br /> But just as I turn to smell the reminiscence<br /> The storm blows again<br /> \"I don't like flowers anymore,\" I said<br />\n            <br />\n        </p>\n        <h4>Red Bricks</h4>\n        <p class=\"no-indent\"><i class=\"caption\">\n                        “Consumed” discusses an issue of self-harm, where each line employs a different kind of imagery. The self-harm depicted in the piece occurs through the means of punching a solid body, ideally a concrete wall. The first line describes the wall as \"red bricks\" and links it in the second line with the idea of \"punching\" using the image of a destroyed wall \"grey ruins.\" It quickly likens the idea to roses, giving a satisfactory feeling like the flower but also associated with thorns. From there, the author shifts once more to describe self-harm and connects roses to the act of punching by likening the roses to rings, where the pointy side faces the bare flesh and unleashes the blood, his soul, out. In the next three lines, the author symbolizes the blood rushing out with an empty wine bottle after a hangover and then announces that it also leaves a mark on the rundown wall. Following the repetition, the author announces that the thorny roses fit his finger no more as he loses his soul and remains a moving empty casket.\n                      </i><br /><br />Red bricks<br/> Grey Ruins<br/> Thorny roses<br/> That fit nicely<br/> A ring around my finger<br/> Poking my soul to go back<br/> Consumed\n            <br/> A bottle of red wine after a hangover<br/> Until my soul reunites with the rubble<br/><br/> Red bricks<br/> Grey Ruins<br/> Thorny roses<br/> That fit nicely<br/> Around my empty casket<br/>\n        </p>\n\n        <h4>Sound of Love</h4>\n        <p class=\"no-indent\">\n            <i class=\"caption\">“Sound of Love” creates the image of a speaking subject with a vivacious voice, before ultimately revealing that this voice is a symbolization of the feeling of love. The piece portrays the long-term effect of love on the lover, bringing the subject peace in times of loneliness, in dreams, and through depression. \n                        <br></i><br> Your voice brings peace unto me<br/> A piece of heaven dwelling on our land<br/> Magical and charming, its merry notes<br/> Chirping like a mockingbird<br/> I might ask if I could<br/> To hear it all-day<br/>            And I feel like hearing it in the memories of my<br/> dreams,\n            <br/> in the lonely nights,<br/> amid the darkness of my thoughts<br/> The void in my veins dissipates in its utterance<br/> And my name, in your notes, slashes like a cupid<br/> through my heart<br/> Oh, shall it be?<br/> The sound of love\n            <br/>\n        </p>\n        <h4>Autumn Leaves</h4>\n        <p class=\"no-indent\">\n            <i class=\"caption\">\n                        “Autumn Leaves” is a haiku-influenced piece, although longer and free of haiku restrictions. The short poem describes the manipulation of toxic relationships and highlights the extremes of this issue, exemplifying the vividity of it when spoken, however, its subtlety to the subject of manipulation.\n                                    </i><br><br> I heard my heart break<br/> But you told me it was the autumn leaves<br/> Crackling under the sole of your black shoe<br/> And I believed you<br/> And I believed you would never lie to me<br/>            And I believed you would never cheat on me\n            <br/> And I believed you… even though it was summer<br/>\n        </p>\n    </div>\n</div>\n</div>\n</div>", "side": "<p class=\"no-indent\">* picture by Free Old Photos on Unsplash</p><p class=\"no-indent\">A collection of short poems written by the author, each bearing profound meaning behind thier lines, either obvious or incredibly subtle. An explanation of each poem is listed in the article.</p>", "desc": "A collection of short poems written by the author, each bearing profound meaning behind thier lines, either obvious or incredibly subtle. An explanation of each poem is included in the article.", "brief": "A collection of short poems written by the author, each bearing profound meaning behind thier lines, either obvious or incredibly subtle. An explanation of each poem is included in the article.", "order": 12, "include": null}]