[{"title": "The Evil Condominium", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/evilcondo.webp", "credits": "byMarcus Loke on Unsplash", "category": "Prose", "cols": 1, "content": "<p>It has not been long since Adam Anderson returned to his old, austere apartment in Mary’s street before he became baffled with the disparity between the image of it he had in mind and what he came to discover. Although the tableau-less walls of imperfect white paint effortlessly trying to cover the gray patches of concrete and the wood-colored furniture remained intact and in their designated places (maybe with minor changes), Adam did feel an unexpected ambivalence. Maybe because of quite a few changes that might have happened to the rest of Mary’s Street.</p><p>Adam’s apartment sits on the western coast of Lincoln city facing the massive greenery that surrounds the Lincoln-PD precinct from one side and facing an oases desert landscape from the other. His apartment (1-11) landed on the first floor of a white condominium cluster coated with many other apartments enough to make him lose count—he was barely familiar with his (2-17) neighbors, let alone anybody else. Most of his neighbors might have had a couple of encounters with him enough to make his name bellringing but not close to creating a lasting bond between him and anybody. Adam, however, preferred a more distant bond. To the east bank of Lincoln’s river, Adam enjoyed the company of Tara Wilson and her friends, deeming him more concealed with his neighbors but far more open to possibilities in that foreign environment.</p><p>Mr. Anderson, as he was often called, faced difficulties re-settling in a condominium cluster that he described as <i>“a land of hate, envy, and vandalism.”</i> For him, the people boarding the same artificial housing structure he lodges had some sort of evil crawling their bones: an evil condominium. The evil he saw in the eyes of Alex that same October–and in his own, before he shot himself with the same P1911 he was reported for conspiring to use in a planned murder.</p><p><i>“Please, Adam, understand that I did not know it would go this far,”</i> Alex called from across the JailGaurd after reporting Adam for conspiracy of murder and vandalism. All fingers pointed at Adam and his network of phishing websites and click baits. They were enough to swat him and get him in jail. <i>“I had to do something. You were ruining lives. I had to intervene,”</i> but Adam knew these words were far from being the truth. Alex has had him in mind for a while, trying to stop him from landing a 1.5-million-dollar deal for the company they both worked for—the envy of a colleague. Maybe Adam was really conspiring for murder, but he was fully aware that Alex did not rat him for the sake of a better society or engendered fear.</p><p>Barely a week, a casual visit to (1-09), and a friendly trust Adam was not known to give out… those were enough to situate Adam at his doomed cold county jail awaiting an unfair trial for a crime he may or may have not committed. Adam has been working his way around that deal for months. Praised by the whole board of administration, they promised Adam a substantial promotion for his endeavors. He worked around landing that deal with a flabbergasting proposal and most of his top-tier team working on the testing trials for their prospective client. However, Adam had his face full of awe on the sight of the testing reports that could waste him months of work; the numbers did not add up.</p><p>Adam might have evaded himself all the trouble in a perfect plan that would have pushed the boundaries of his current life class if he did not seek help from his (1-09) colleague—and you might wonder what makes Adam think immediately of Alex for technical help aside from working at the same company when (1-12) lodged someone perfectly suited for that job, but Adam couldn’t stop himself from pulling a toxic flex. Alex’s envy for Adam never dissipated his face; he did not even show an effort to hide it, and Adam was content by telling himself that he is not flexing—that he is just an extraverted person who loves to share. For someone like Alex, all he could see is an opportunity to wear his nemesis down, interpreting the numbers to be deliberate breaches and phishing attempts to convince an unwary client. Those numbers could have been anything from serious attacks to Adam threatening a client with murder through their servers to land a deal, and it is easy to tell what story Alex claimed to have evidence for. He affirmed to have reported it to a senior colleague out of friendliness and worry for his fellow. He was lying.</p><p>While Adam might have felt a comforting vibe in the county jail that did not look much worse than a self-abnegating condo, he was soon bailed out before the trial scheduled in three months—a result of some strings being pulled here and there. Adam’s ravaging anger rectified to the point that he would pull a gun on Alex if he bumped into him in a corridor, but he did not—not yet. Not to anybody’s surprise, Adam became the talk of the whole city—from Mary’s street on the west coast to Boulder county on by the west. The loath of the condominium cluster to Adam become more vibrant—he has always hated that place. At least before, it used to smell of Windex and Comfy, but now all he can smell is the vomit he asphyxiates on in his late-night nightmares. Too many people have told Adam all sorts of stories about what had led him there, some through the JailGaurd, some when he got back home. The stories conflicted in parts and agreed in others. Some were a unilateral addition to the timeline, but felt logical, so Adam believed them as he drafted the course of what happened through the past few days. Others, however, were unanimous, but shady, and felt like a cover-up. No one knew what Adam was capable of doing to Alex, and no one dared to experiment. It was some sort of agreed-on protection that not even Alex asked for.</p><p>The condominium had gone on a rampage for Adam. He was detested and frowned upon. He was getting further and further from everyone around him each day. By December, he was as lonely as the last tree leaf in the winter. He had only remained close to his last friend, Tara Wilson, getting closer every day. The more the evil condominium hated Adam, the more he felt an attachment for her. They weren’t lovers, but they always resembled two lovebirds—confused, and the condominium brought the confusion even further. Adam knew that his life was voided when he decided to let her be his only friend, and he did feel the lonesome breeze when she would take her personal time—time off a complicated life of the condominium cluster society, something that took anywhere from a couple of days to a couple of weeks at a time. The void greeted Adam in the morning and filled him with anxiety to sleep. </p><p>You could say that he forgave Alex, but he did not. If you have known Adam by then, you would be surprised by the fact that he never revenged. Something inside was turning into a different color—glowing in a unique way Adam has never experienced amidst the toxicity of the condominium cluster. Maybe he was trying to care for someone for the first time in his life—and that’s not Alex. Adam cared for Tara enough that he did not want her to see him as someone evil, and that was the first time Adam realized he was evil—he saw the same gleam in Alex’s eyes but in his. It is hard to make such a realization—for Adam, many memories of wickedness washed over him… ones he never realized before. He had to face the mirror every time he enters through the condominium cluster entrance or in the bathroom—only seeing a shade of vomiting green covering what he thought was the flesh of innocence. His aura, all in black. He would also see the reason why he can see his true colors now—Tara Wilson definitely meant something to him.</p><p>Would he ever tell her of his love? Adam kept thinking, denying, refusing to believe loving someone, but he knew that the smell of vomit of the evil condominium dissipates when he thinks about her—overtaken by roses and jasmines, but Tara was much more of a stubborn person… she did not want that. <i>“How would it feel when the last person in your life puts you down, too, Adam,”</i> he wondered to himself. <i>“It’s dark in here. I feel the walls closing on me. I’m devoured by the ghosts of darkness. It is not supposed to be like this; why would Tara just leave? I am not good enough for her: I know I only look out for myself, but I wanted to look out for her too; I’m afraid of the dark. Help…,”</i> he barely breathed in reply to himself. Adam was no longer tolerating what became of him. <i>“It’s dark in here. I can’t breathe. Please help…,”</i> but no one listened; Adam did not have anybody to help him. </p><p>The air breeze as the new year welcomed was heartwarming in Mary’s street condominiums. Despite the coldness of winter, it did feel so sincere and lovely. Maybe nobody came to help Adam and that’s why nobody saw him in the new year celebrations. Maybe everyone was busy hanging decorations and filling candy socks over their mantelpieces. Maybe that’s why no one found Adam for a week to come… covered with blood, a result of a P1911 gunshot… in his evil condominium.</p><p>While Adam might have felt a comforting vibe in the county jail that did not look much worse than a self-abnegating condo, he was soon bailed out before the trial scheduled in three months—a result of some strings being pulled here and there. Adam’s ravaging anger rectified to the point that he would pull a gun on Alex if he bumped into him in a corridor, but he did not—not yet. Not to anybody’s surprise, Adam became the talk of the whole city—from Mary’s street on the west coast to Boulder county on by the west. The loath of the condominium cluster to Adam become more vibrant—he has always hated that place. At least before, it used to smell of Windex and Comfy, but now all he can smell is the vomit he asphyxiates on in his late-night nightmares. Too many people have told Adam all sorts of stories about what had led him there, some through the JailGaurd, some when he got back home. The stories conflicted in parts and agreed in others. Some were a unilateral addition to the timeline, but felt logical, so Adam believed them as he drafted the course of what happened through the past few days. Others, however, were unanimous, but shady, and felt like a cover-up. No one knew what Adam was capable of doing to Alex, and no one dared to experiment. It was some sort of agreed-on protection that not even Alex asked for.</p><p>The condominium had gone on a rampage for Adam. He was detested and frowned upon. He was getting further and further from everyone around him each day. By December, he was as lonely as the last tree leaf in the winter. He had only remained close to his last friend, Tara Wilson, getting closer every day. The more the evil condominium hated Adam, the more he felt an attachment for her. They weren’t lovers, but they always resembled two lovebirds—confused, and the condominium brought the confusion even further. Adam knew that his life was voided when he decided to let her be his only friend, and he did feel the lonesome breeze when she would take her personal time—time off a complicated life of the condominium cluster society, something that took anywhere from a couple of days to a couple of weeks at a time. The void greeted Adam in the morning and filled him with anxiety to sleep. </p><p>You could say that he forgave Alex, but he did not. If you have known Adam by then, you would be surprised by the fact that he never revenged. Something inside was turning into a different color—glowing in a unique way Adam has never experienced amidst the toxicity of the condominium cluster. Maybe he was trying to care for someone for the first time in his life—and that’s not Alex. Adam cared for Tara enough that he did not want her to see him as someone evil, and that was the first time Adam realized he was evil—he saw the same gleam in Alex’s eyes but in his. It is hard to make such a realization—for Adam, many memories of wickedness washed over him… ones he never realized before. He had to face the mirror every time he enters through the condominium cluster entrance or in the bathroom—only seeing a shade of vomiting green covering what he thought was the flesh of innocence. His aura, all in black. He would also see the reason why he can see his true colors now—Tara Wilson definitely meant something to him.</p><p>Would he ever tell her of his love? Adam kept thinking, denying, refusing to believe loving someone, but he knew that the smell of vomit of the evil condominium dissipates when he thinks about her—overtaken by roses and jasmines, but Tara was much more of a stubborn person… she did not want that. <i>“How would it feel when the last person in your life puts you down, too, Adam,”</i> he wondered to himself. <i>“It’s dark in here. I feel the walls closing on me. I’m devoured by the ghosts of darkness. It is not supposed to be like this; why would Tara just leave? I am not good enough for her: I know I only look out for myself, but I wanted to look out for her too; I’m afraid of the dark. Help…,”</i> he barely breathed in reply to himself. Adam was no longer tolerating what became of him. <i>“It’s dark in here. I can’t breathe. Please help…,”</i> but no one listened; Adam did not have anybody to help him. </p><p>The air breeze as the new year welcomed was heartwarming in Mary’s street condominiums. Despite the coldness of winter, it did feel so sincere and lovely. Maybe nobody came to help Adam and that’s why nobody saw him in the new year celebrations. Maybe everyone was busy hanging decorations and filling candy socks over their mantelpieces. Maybe that’s why no one found Adam for a week to come… covered with blood, a result of a P1911 gunshot… in his evil condominium.</p>", "side": "<p class=\"no-indent\">* picture by Marcus Loke on Unsplash</p><p class=\"no-indent\">This piece describes a time of isolation set in a hypothetical location “the condominium,” which corresponds to the author’s high school. Most of the events described reflect only the emotional impact of the experience rather than an authentic representation of the experience itself.</p>", "desc": "This piece describes a time of isolation set in a hypothetical location “the condominium,” which corresponds to the author’s high school. Most of the events described reflect only the emotional impact of the experience rather than an authentic representation of the experience itself.", "brief": "This piece describes a time of isolation set in a hypothetical location “the condominium,” which corresponds to the author’s high school. Most of the events described reflect only the emotional impact of the experience rather than an authentic representation of the experience itself.", "order": 1, "include": null}, {"title": "The Universal Division Equation of Man", "year": 2021, "nyear": "21", "image": "/legacy/images/articles/divison.webp", "credits": "byMahir Uysal on Unsplash", "category": "Prose", "cols": 1, "content": "<style>\n    @import url('https://fonts.googleapis.com/css2?family=Playfair+Display:ital@1&display=swap');\n</style>\n<p class=\"no-indent\" align=\"center\" style=\"font-family: 'Playfair Display', serif; font-size: inherit;\">\n    I am watching Jupiter strolling our<br>skies like the long-orphaned by luck, greeting<br>Saturn as they commence their tip-toe dance,<br>shining vividly to bless their meeting<br><br>I am watching stars absorbed in heaven,<br>as if befuddled of some\n    heavenly wine<br>dancing to the beats of stars colliding<br>just as their midget steps escape the twine<br><br>I am watching the ether reciting <br>epilogue of the dancing lodgers<br>Adieu, Jupiter. Adieu, Saturn. Ad-<br>-ieu. They shrink as if they\n    were toddlers...<br>...into nothing<br><br>Do the heavens and cosmos know of me,<br>know of my reflection in the mirror?<br>Or do I fade in the vast universe,<br>demolished in puny size, a zero?\n</p>\n\n<p>\n    <i>“Where am I?”</i> a childlike figure asks, his eyes glistening with a luminous white of the walls that surrounds him as he stares into the extents of sight. The white room deforms its cubic shape, extruding in the direction of his sight into a\n    long corridor.\n</p>\n<p><i>“You are nowhere,”</i> a voice replies, startling the child. The man seemed as if he spawned on spot, standing peacefully behind the child.</p>\n<p><i>“If I am nowhere, then what is this?”</i> the child questioned, looking intrigued. </p>\n<p><i>“This is nothing,”</i> the man traverses the dimensions of the room with his eyes.</p>\n<p><i>“Then, what am I doing here?”</i> </p>\n<p><i>“The impossible, something deemed by all of your kind, irrational, yet they do every day.”</i></p>\n<p><i>“...and what should that be?”</i></p>\n<p><i>“You are dividing by zero,”</i> the man announced.</p>\n<p><i>“Dividing? Zero?”</i> the child figure thought to himself. He may have not been alive for long, but the idea seemed out of place. <i>“How can you divide by nothing?”</i> his thoughts followed.</p>\n<p><i>“Let me answer the question. Come with me,”</i> the man responded to the unspoken question as the walls fell into oblivion, revealing the suspended transparent corridor in the middle of a nebula, overseeing Earth. As the two wanderers walk across the\n    corridor, the man begins:</p>\n<p> <i>“See, child, this is your home. It is just like this room, nothing. Take a good look, you are spending a lot of time here. </p>\n<p>Look around and above, every person you will get to meet lodges this finite sphere of nothingness. Your kind will cross sea and land, star and planet, to find another of their kind, or any kind at all. I never heard they were lucky.</p>\n<p>It is scary how oblivious the universe is to their existence, yet they will baffle you. You will see bullies, haters, criminals, wars, deaths, famines. You will see people fighting over chunks of this insignificant void.</p>\n<p>Your kind has defined the universe in their own existence, and they started the endless cycle of refuting the most basic rules of nature. Every day, the universe is, in a sense, divided over them—determined through their presence, but what are they, if\n    they are not a zero?”</i></p>\n<p><i>“I could be a little slow, mind my age, but what does it mean to divide?”</i></p>\n<p><i>“In your world, to divide is to spread evenly. That is what makes division over zero impossible: you simply cannot spread over ‘nothing’. Here, to divide is to think the universe is spread evenly over you or your kind alone, to think that your actions\n    are of cosmic importance, just like your kind have been doing forever.”</i></p>\n<p><i>“So, what am I? A nothing?”</i></p>\n<p><i>“In your eyes, you are not,”</i> the man said as he ushered the child to look down into Earth as the corridor teleported their figures into a classroom scene. The man pointed to the 14-year-old, seated alone, reading a copy of Thus Spoke Zarathustra\n    for Nietzsche; you can feel discomfort in his posture, who would befriend someone like that?:</p>\n<p><i>“That is you, and right now, how loneliness hurts you is of cosmic importance to you, yet to the universe, you and your kind are ‘undefined’ in the division. Your actions and desires remain minuscule in a heavenly equation. It sounds purposeless so long\n    that you are thinking as if you matter to the skies. However, the equation of the universe is not the only one that exists. There is of your planet, and your country, and your city, and your school, and your class, and then comes yours. In your equation,\n    you do not stand as a zero; you have a value, because, from your perspective, you are everything that defines your existence. Cogito, ergo sum: you think, therefore you are. You read that somewhere.”</i></p>\n<p><i>“So, you brought me here to continue this cycle, to divide by zero? What is the point?”</i></p>\n<p><i>“Yes and no,”</i> the corridor shifts into a high school campus. The child sees his older self trying to make friends after spending years of loneliness during middle school. <i>“One day, you will grow to learn the true meaning of friendship, and in your equation,\n    you will stop feeling lonely; in their equation, you will be a lifelong friend to remember.”</i> The corridor shifts again into a classroom, a one in which the child’s older self is standing for the fourth hour, giving his weekly lectures. <i>“Then, you\n    will be back into a classroom, but this time, you will stand confident instead of hurt: you will be the influence to the few dozens now before you continue to influence thousands, being more than nothing in all of their equations.”</i> The corridor\n    shifts once more into the dorm room: the child sees grown-up him staring at the sky. <i>“Then, one day, you stare out your window at Jupiter and Saturn, and you will write the many poems you keep today in your notes, how the cosmos reminded you of the one person\n    you loved so dearly, how the cosmos reminded you of your friends, and how it reminded you of how you are constantly dividing by zero.”</i></p>\n<p><i>“Why? Why are you telling me all of that?”</i></p>\n<p><i>“Because, my child, on the day you stared at Jupiter and Saturn, I was born: an older you. You wrote me in a poem to remind yourself that the universe is expansive compared to our puny essence, an influence of ‘Man’s Search for Meaning’ probably. You\n    wanted me to stop you from getting overwhelmed in the personal success that you forget to live, to be human. You needed to understand that no matter how attractive the prize was, in the end, it was another division by zero, and you felt the need to\n    be reminded that your equation and the equations of others matters more, so that you will never be consumed enough to hurt others while attempting to prosper your equation. It was a time of realization for you, how you should never be blinded by personal\n    desires when they can cause hurt people around you, especially yourself.”</i></p>\n<p><i>“...and will I remember any of this?”</i></p>\n<p><i>“One day, you will stare at the sky, and I will flow into a poem of yours...</p>...as our never-ending cycle continues—the division by zero.”</i>", "side": "<p class=\"no-indent\">* picture by Mahir Uysal on Unsplash</p><p class=\"no-indent\">This essay discusses a personal view of human existence from the dual-perspective of existentialism and relativism. It criticizes human behavior with oneself, others, and the universe at large. Personal anecdotes included are accurate and representative of the author. Additionally, this essay frames its answer through a consideration of the mathematical problem of “the undefined division by zero.”</p>", "desc": "This essay discusses a personal view of human existence from the dual-perspective of existentialism and relativism. It criticizes human behavior with oneself, others, and the universe at large. Personal anecdotes included are accurate and representative of the author. Additionally, this essay frames its answer through a consideration of the mathematical problem of “the undefined division by zero.”", "brief": "This essay discusses a personal view of human existence from the dual-perspective of existentialism and relativism. It criticizes human behavior with oneself, others, and the universe at large. Personal anecdotes included are accurate and representative of the author.", "order": 2, "include": null}, {"title": "The Callous and The Lenient", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/callouslenient.webp", "credits": "byFrida Bredesen on Unsplash", "category": "Prose", "cols": 1, "content": "<p>The observer looks at the polished Prisca mirror, loathing the man in his reflection, the one he called Adam. He detested the sight, longing for his other persona with its captivating appeal even if it always got under his skin. Sprawled on the ground next to Adam were pictures: a photograph of Adam staring dumbfounded to the camera, another in grade-school where he smiles at his best friend, and a photo from middle school night over when he stayed up designing posters with a friend who just lost her cat. Although none taken at the same time, they all shared one fundamental element: innocence, the type that tended to fade as people’s hair traversed lighter shades of grey. The observer couldn’t hide his disgust of Adam, secretly wishing to be like the other: Akkademi. <i>“What good would being nice ever bring me when all are beasts with nothing but ruthless competition in their hearts?”</i> </p><p><i>“What are you doing standing over there? ”</i> Akkademi questioned as he approached the observer’s sight of the mirror realm, pushing Adam away. <i>“Stand there and you will scare the man for life,”</i> he chuckled, when Adam could do nothing but mockingly stare. By Akkademi’s foot lay another parade of photographs—ones that spanned high school this time: one had Akkademi cramming for his finals, in the fear of someone outpacing him. Akkademi never knew how to get enough, bringing into life non-existent competitors to compete against when none was left. Another picture shows Akkademi standing proudly, a certificate in hand with a broad grin on his face, boldly looking at the camera’s lens. In the last one, he is surrounded by 20-something of his friends—even if none of them were ever close—and hanging his arms around two. </p><p>In every aspect, Adam and Akkademi were the two opposite poles of a magnet, failing to co-exist at the same place and time. </p><p><i>“Cower in fear like you always do with that… whatchamacallit... emotions of yours,”</i> Akkademi kept his mockery on display. <i>“Remind me, where are all your imaginary middle school friends again? When were they when you found nobody on your side!”</i></p><p>Akkademi never believed in emotions or people of any kind. He always saw himself as his own protector and believed in the pride of the fruit of his own hands.</p><p><i>“My fear? You call it fear?”</i> Adam screamed on top of his lungs, stepping away from his usual silent side. Adam was more sensitive and believed in true friendship, limiting himself to a selected niche. His sensitivity made him more aware of the feelings of those he loved and loved him back.</p><p><i>“What else do you call it, young man? How else do you describe yourself?”</i></p><p><i>“What you call fear is our savior! Emotions saved us! The people I know saved us when your heart attracted none but those who wished for your defeat when you deemed all people as equal.</p><p>Remind me when all hated you, who out of the hundreds you had by your side stayed? Which of the lot disbelieved the rumors? </p><p>Who were the ones who pushed you when you were slacking around, unwary of what others had of hatred in their hearts for you?”</i></p><p>Akkademi felt enraged by Adam’s words for he never liked to lose the position of power, and as this position was exchanged, arguments began to run out. Both characters quarreled, howling their lungs out, and pinning each other to the ground. With their voices resonating across the thin glass of the mirror into the real world, they failed to notice that the ground beneath them was shaking to the frequency of their tunes. </p><p>The observer in the real world stands still as the tarnished oak is showered with glass. It only took a fraction of a second to break the pride of Akkademi and the endearment of Adam, breaking the mirror realm into ashes of the past. As the last piece of glass clashed with the ground, a finer, darker sheet of glass showed up from beneath. This sheet had but one reflection to the face of our observer: the face of Omar, realizing his disgust for either Adam or Akkademi was unfounded. Akkademi was the hard-worker and the self-protector, who kept Adam safe at all times, while Adam balanced out the pride of Akkademi, choosing his friends wisely and always bringing with him the emotional and mental support they needed.</p><p>One last photograph lies on the floor next to Omar, the observer, a one from senior year, looking at the camera, smiling with his significant prideful eyes. Two of his friends seated by his side and four on the other dormitory bed, commemorating the night after his Adam stayed up late, mixed with a jolt of Akkademi’s hard-working character, with his friends in need of help with their essays.</p>", "side": "<p class=\"no-indent\">* picture by Frida Bredesen on Unsplash</p><p class=\"no-indent\">Adam, the lenient, encounters Akkademi, the darker, more vigorious version of himself, the callous. They are two sides of the same coin, fighting for domination over the character of the observer. Their characters split into human beings only when seen through a reflection in the mirror. As the observes watches, the heat grows between the two characters.</p>", "desc": "Adam, the lenient, encounters Akkademi, the darker, more vigorious version of himself, the callous. They are two sides of the same coin, fighting for domination over the character of the observer. Their characters split into human beings only when seen through a reflection in the mirror. As the observes watches, the heat grows between the two characters.", "brief": "Adam, the lenient, encounters Akkademi, the darker, more vigorious version of himself, the callous. They are two sides of the same coin, fighting for domination over the character of the observer. Their characters split into human beings only when seen through a reflection in the mirror.", "order": 3, "include": null}, {"title": "An Extraordinary Cup of Coffee", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/coffee.webp", "credits": "byNathan Dumlao on Unsplash", "category": "Prose", "cols": 1, "content": "<p>The cold kitchen counter contrasted the searing cezve some mid-winter Saturday. Adam, half-dressed, skimmed a couple of pages of Around the World in 80 Days as he held a bottle of skimmed-milk, ready to put together his daily sum of vanilla-syrup cappuccino. “This man can’t be real,” Adam mockingly laughs every now and then at the character of Phileas Fogg. Mr. Fogg had his sense of appeal, the same appeal that pulled Adam to Berlin and Dammam; the same tenderness that brings him to remember the Kinderhütte, playing with kids every weekend, or that one time he spoke to the police officer in fluent German when his mom couldn’t.</p><p>Adam’s enchantment with his past, however, couldn’t overwhelm his derision for Fogg. Only a couple of seconds later, Adam swiftly distances the bottle of skimmed milk as a new feeling overtook him: “Milk doesn’t fit coffee, just like me,” he settles for dark coffee. Adam failed to understand what part of the journey bore interest to Fogg. “He wasn’t as lonely as I was. At least, he had Passepartout,” Adam explained to himself.</p><p>In so many years, Adam never felt he belonged anywhere, and he couldn’t wrap his head around how Fogg dealt with new cultures. In each of the two countries, Adam had barely any friends. He’d only visit the Kinderhütte once per week, spending most of his week alone with his favorite reads. Even there, all the kids understood the culture he didn’t get and lived traditions not celebrated in his household. “Fogg went to 6 countries and I can’t even survive three,” Adam ridiculed himself.</p><p>Adam puts on his flannel shirt and black denim, almost done with his Saturday ritual before arriving at school for the rest of the week. He sips on his coffee as his face muscles twitch in disgust, not because of the simmering pitch-black coffee but rather the memory of his sophomore year. “This place is evil,” he believed—two years ago. The place was a boarding school, a one Adam only joined to stay in his hometown—thinking he’d fit there. Having lived in the middle of urban Berlin and the Arab Sahara, Adam couldn’t even fit the molds of a school in his own country: he was as alone as before. </p><p>Before the next sip of coffee, Adam heaves a teaspoon full of sugar into it—rubbing the mouth place of the cup in circles with his index finger. Unlike Foggs, Adam always evaded a part of his identity: he never fully embraced himself. By the time Adam went back to Egypt, he couldn’t call himself solely Egyptian anymore: a part of him begged to differ—the part that elevated into control during the Siwa trip. To the friends he made that day, Adam assimilated three cultures: the Egyptian beauty of Siwa meshed with the long-held tradition of Saudi Arabian grilling in the desert, right next to the many German side dishes he cooked that day.</p><p>It was a time when Adam realized how his exceptional culture is the answer to his desire of belonging; the same answer he gave during classes of Arabic and German, discussing how vocabulary pertain in importance to its culture or its regional varieties, giving his classes a taste of the cultural authenticity. He would debate once the local perception of one word, talk about the different accents in Germany, or tell stories about their unique traditions like Tanz in den Mai or the Tatort.</p><p>Before the last sip of his extra-sugary coffee, Adam puts on his shoes, ready to embark on his journey. “I can be another Fogg,” he notes to himself, thinking of his next destination. He imagines a campus situated in New England’s largest city. A campus that hosts the Cultural Rhythms every year, where Adam could be the western-and-eastern-flavored Egyptian for students who felt left out, believing they had to fit a predefined mold. It is also the same campus of ARTS FIRST, where Adam can showcase his poetry that symbolizes a culture that doesn’t apply to a single geographical location. Over the four years, Adam may also debate lingual intricacies during his linguistic classes from the perspective of three different cultures at once, or might give his house a taste of his quirky cuisine that proudly crosses borders. </p><p>Adam shuts the door behind.</p>", "side": "<p class=\"no-indent\">* picture by Nathan Dumlao on Unsplash</p><p class=\"no-indent\">Isolated and lonely, the authors psuedo-character Adam is presented once again to tell the story of growth into loving every part of himself. Although the essay discusses cultures mainly, the time of realization noted in the essay is descriptive of other aspects as well, including his character, the way he interacts with people, his friends, and his love for others.</p>", "desc": "Isolated and lonely, the authors psuedo-character Adam is presented once again to tell the story of growth into loving every part of himself. Although the essay discusses cultures mainly, the time of realization noted in the essay is descriptive of other aspects as well, including his character, the way he interacts with people, his friends, and his love for others.", "brief": "Isolated and lonely, the authors psuedo-character Adam is presented once again to tell the story of growth into loving every part of himself. Although the essay discusses cultures mainly, the time of realization noted in the essay is descriptive of other aspects as well.", "order": 4, "include": null}, {"title": "The Gift", "year": 2021, "nyear": "21", "image": "/legacy/images/articles/gift.webp", "credits": "byLon Christensen on Unsplash", "category": "Prose", "cols": 1, "content": "<p>It’s 8:00 PM. You’re late for our date, as usual. I step outside of our reserved table into the street for a good sense of fresh air. Sometimes I think of what brought me here. Of all the places in the world, you had to choose here. I would have wanted a fancier place for your special day, but then, it had to overlook the Northtower building I hate, so what can a man do? You didn’t even ask me if I’d be comfortable around here or not. Am I? To be honest, I don’t care much. I’m not that kind of a person. It’s 8:30 PM. You’re an hour late. You’re not picking up or texting me back. Excuse me, miss… but what is happening here? I order a drink for myself… or two. I should have waited for you because that was enough to get me full.</p><p>The clock strikes 9:00 PM. I stroll down the street once again, but this time I’m leaving. You better have a good explanation for this. “Where exactly do you think you’re going,” a young woman held my hand from behind and questioned.</p><p> “Oh, so finally you ca—I mean… you… are…”</p><p>“What? A tease? Go on, say it. I know you want to say it. Shower me with it.”</p><p>“…gorgeous,” my mouth gasped to the sight of your white top beneath your pulled-up hair. “I mean… No,” I follow, back to my sane mind that was still mad at you, “Where have you been for god’s sake?”</p><p>You gave me a blank stare for a second and stepped back into the restaurant. I, helplessly, followed.</p><p>“I mean if you don’t want your gift, you can leave.”</p><p>“Excuse me, miss, what gift? It’s your birthday, pumpkin.”</p><p>“Yet, you didn’t even wish me a happy birthday.”</p><p>“Oh. I’m sorry. Happy bi—”</p><p>“Shut up, dumbo. So, I missed your birthday, right? I was thinking, why not make this both of our birthdays. You know, I didn’t want to miss your birthday, and we are already here. Why not? Your birthday comes first; it only makes sense if I say first, so here goes nothing: happy birthday, honey bunny. I wish you all the best in the world. That best is definitely me, but yeah, I wish you have me forever, dumbo.”</p><p>I kind of felt bad at this moment. You thought of me more than I did of you. For real, I was just about to leave. Ouch, not again… the feel of guilt is sinking in. Not now, not today, please! I mean, what if your gift is better than mine? What if—ouch again… I should say something. I can’t just stare into the wall. How on earth did I forget to wish her birthday?</p><p>“Happy birthday, pumpkin. I’m so happy you’re here today. My happiness is incomparable. I love you, little pumpkin,” I say as you gaze upon the building to the face of the restaurant glassy façade. </p><p>“Oh, the Northtower. It’s less prestigious at night. I wonder if anything is happening there right now,” I mentioned. </p><p>“Nothing much probably,” you said, dozing off in the middle of the sentence before you came back to your senses and said: “Ahem. Sorry. So, like I was saying, it is only fair if I give you your gift first, and don’t try to tell me no.”</p><p>Yes, I was about to tell her that. I don’t want to go first anyway. Probably will make up an excuse on how I forgot hers if the one she brought me is much better. </p><p>Here it comes.</p><p>“Soooooooo… Ummm… ahh here we go… yup,” you mumbled as you pulled it out of your bag, a rectangular wrap taking the shape of its contents, around 7 inches tall by 4.5 wide, I guess?</p><p>“You didn’t have to, really! Thank you, pumpkin”</p><p>“You know I like the ‘little’ part the most, right? Don’t forget it. This is a book, bunny.”</p><p>“A book?”</p><p>“Yes. I wrote it… for you. It’s more of a compilation of stories of us… some just you. Most of them just happened in my mind. I have been working on it for the past month or so and until this morning. I’m sorry for being late, but it was at the printing facility and I had to wait for it.”</p><p>“You could’ve at least called.”</p><p>“I knoooow. Just shut up and don’t make me feel worse already.”</p><p>I don’t really want to give her the gift, now. Where was my mind? I got her a necklace. I could’ve gotten her something better. She spent a whole month working on mine, which I didn’t even know existed. </p><p>“I love you. This is amazing”</p><p>“What… you are not going to kill me?”</p><p>“Kind of want to, but no… not today. You have a pass since it’s your birthday.”</p><p>“Shut up. Where is my gift… huh… where?”</p><p>“I’m your best gift, dumbo,” I responded.</p><p>“Haha, so funny. Now, where? I’m getting impatient.”</p><p>“Stop. Listen, the gift I got for you is useless. I hate being in this situation. I’m sorry,” I claimed. </p><p>“Lucas,</p><p>\tBunny… just show me,” you softened your voice. </p><p>“Here. Don’t laugh at me. I’m sorry, and yeah… don’t get mad. It’s nothing compared to how much you worked on my gift. I could’ve done better. It’s your birthday since we got together and I hate this. Things were just cramped on top of each other. It’s just that---”</p><p>“Bunny, do you ever stop talking? I love it! This is the best gift anyone has ever gotten me. Happy birthday, bunny.”</p><p>You didn’t like it, and it was definitely not the best gift you ever got. </p><p>You just didn’t.</p>", "side": "<p class=\"no-indent\">* picture by Lon Christensen on Unsplash</p><p class=\"no-indent\">This piece is a light-hearted story, which happens to be a part of a mini-story series following the same theme. The scene portrays two character over dinner date, celebrating a very special ocassion while anxiety and tension grows in the mind of one of the subjects.</p>", "desc": "This piece is a light-hearted story, which happens to be a part of a mini-story series following the same theme. The scene portrays two character over dinner date, celebrating a very special ocassion while anxiety and tension grows in the mind of one of the subjects.", "brief": "This piece is a light-hearted story, which happens to be a part of a mini-story series following the same theme. The scene portrays two character over dinner date, celebrating a very special ocassion while anxiety and tension grows in the mind of one of the subjects.", "order": 5, "include": null}, {"title": "Binaries", "year": 2020, "nyear": "20", "image": "/legacy/images/articles/binaries.webp", "credits": "byKelly Sikkema on Unsplash", "category": "Prose", "cols": 1, "content": "<p>Their grass-tickled hooves wander the Serengeti in a pilgrimage of unity. Tails so black that contrasts their presence in the bright African summer sky. They roam and roam—back and forth ever so slightly in the lands of the devil. Their devil comes with no horns or flames though, but from their neighbors who did not read Matthew 19:19.</p><p></p><p>Their neighbors and cousins (all family tree curtsey of Charles Darwin—please refer for any legal processions) patched in black spots (or not) over their sun-colored fur. Their teeth stemming from their golden fur gore the insides of the African grass-adorer, tearing their world of binarism apart. A world of binarism that their skin befell in their black and white stripes that could only look like a marching militia over the body that is plated with shimmering white gold.</p><p></p><p>Once torn, a new color shall be bestowed upon our so-deceased herbivore of the African Savannas. In all glory, red, the archenemy of the blue sky and river, stains all white, black, and green. Creating a world that falls in-between: a gradient; a fluid of colors.</p><p></p><p>Such a fluid makes you wonder in people. People say homosexual and heterosexual, male and female, utopia and dystopia, alive and dead, past and present, light and shadow, war and peace. They say sky and land, man and animal, dry and wet, cold and hot. They say, and say, and say—and keep babbling in binaries: 01110011011101000110111101110000. Their binaries are well defined: a story of the zero and the one, or so is believed. A story that builds the universe: stripes of a zebra.</p><p>The zebras never agree. The river, from which our united dazzle of zebras hydrates their aching binary throats, or get asphyxiated by a hunching crocodile, flows. Everything flows and flows. A natural rhythmic gradient: sometimes laminar, sometimes turbulent. Alternating waves of steadiness and utter mess: spreading in all dimensions, more complicated than our simplistic understanding.</p><p>People always forget the world in-between, the gradient from black to red to white: the stains all-over. In the Serengeti, the world lays a fluid of sexual orientations—not only a predetermined binary of black and white stripes. Stripes ever so contrasted you could believe a complete Utopia or an overarching Dystopia exists—but it is also a fluid. You stare around, and you question light. What is light? Is sunlight through the glassy windows more of a light than my $3.99 candelabra light bulb seated inside the drum-shaped stand lamb by the left inner corner of my room, or are they both the same? And if 95° 's sun is hot; how should I describe my 212° kettle?</p><p>You could wander in the realm of Zebras for days to come.</p><p>It almost tells you something about our world.</p>", "side": "<p class=\"no-indent\">* picture by Kelly Sikkema on Unsplash</p><p class=\"no-indent\">This piece is influenced by pride day and the repeated calls that claim homosexuality is unnatural. Influenced by elements of the African savanna, the author describes feeding habits of animals as an allegory of non-binarism, prompting the reader to rethink a monochromatic prespective into a more colorful and inclusive ideology.</p>", "desc": "This piece is influenced by pride day and the repeated calls that claim homosexuality is unnatural. Influenced by elements of the African savanna, the author describes feeding habits of animals as an allegory of non-binarism, prompting the reader to rethink a monochromatic prespective into a more colorful and inclusive ideology.", "brief": "This piece is influenced by pride day and the repeated calls that claim homosexuality is unnatural. Influenced by elements of\nthe African savanna, the author describes feeding habits of animals as an allegory of non-binarism.", "order": 6, "include": null}]